#include <stddef.h>
#include <stdio.h>
#include <math.h>
typedef  unsigned int u32;
typedef  int s32;


/*
    FILE* fd = fopen("./table.c","w");
    float d=3.141592654/180.0;
    float res=0.0;
    fprintf(fd,"unsigned int sin_table[] = {\n\t");
    for (int i=1; i<=90;++i){
        fprintf(fd,"%10.0f, ",round((0xffffffff/2)*sin(res)) );
        res+=d;
        if(i%10==0) fprintf(fd,"\n\t");
    }
    fprintf(fd,"\n};\n");
    fclose(fd);
    printf("%f\n",sig_sin(-45)/2147483647.0);
*/

const unsigned int sin_table[] = {
	         0,   37478757,   74946098,  112390613,  149800885,  187165527,  224473156,  261712408,  298871956,  335940465, 
	 372906643,  409759229,  446487000,  483078765,  519523381,  555809744,  591926771,  627863492,  663608960,  699152286, 
	 734482644,  769589272,  804461476,  839088633,  873460196,  907565694,  941394740,  974937028, 1008182341, 1041120609, 
	1073741740, 1106035798, 1137992946, 1169603450, 1200857680, 1231746117, 1262259351, 1292388088, 1322123150, 1351455479, 
	1380376141, 1408876326, 1436947353, 1464580670, 1491767861, 1518500645, 1544770876, 1570570555, 1595891822, 1620726963, 
	1645068414, 1668908760, 1692240740, 1715057245, 1737351325, 1759116191, 1780345211, 1801031920, 1821169948, 1840753298, 
	1859775936, 1878232066, 1896116068, 1913422493, 1930146069, 1946281703, 1961824480, 1976769664, 1991112703, 2004849229, 
	2017975057, 2030486189, 2042378814, 2053649309, 2064294241, 2074310367, 2083694637, 2092444192, 2100556366, 2108028690, 
	2114858886, 2121044873, 2126584769, 2131476884, 2135719730, 2139312013, 2142252640, 2144540714, 2146175539, 2147156616
};
#define MAX_SIGN 2147483647

/**
 * @brief  высчитывает 0xFFFF FFFF/2 * sin(deg)
 * @note   
 * @param  deg: угол в градусах
 * @retval 
 */
s32 u_sin(s32 deg){
    s32 retval=1;
    deg=deg%360;
    if(deg<0){
        retval*=-1;
        deg*=-1;
    }
    if(deg<90){
        return sin_table[deg]*retval;
    }
    if(deg<180){
        return (MAX_SIGN - sin_table[180-deg])*retval;
    }

    return u_sin((deg-180)*retval);
}

// <Косинус>
s32 u_cos(s32 deg){
    return u_sin(deg-90);
}

// // <Тангенс>
// s32 u_tg(s32 deg){
//     return u_sin(deg)/u_cos(deg);
// }

// // <Котангенс> мяу :3
// s32 u_ctg(s32 deg){
//     return u_cos(deg)/u_sin(deg);
// }

//<итерационная формула Герона>
u32 u_sqrt(u32 A)
{
    u32 x=A/2;
    for (int k=0;k<100000;k++){
        x=(x+A/x)>>1;
    }
    return x;
}


//==============================================================================================================================

// int main(int argc, char const *argv[])
// {
    
//     // FILE* fd = fopen("./table.c","w");
//     // float d=3.141592654/180.0;
//     // float res=0.0;
//     // fprintf(fd,"unsigned int sin_table[] = {\n\t");
//     // for (int i=1; i<=90;++i){
//     //     fprintf(fd,"%10.0f, ",round((0xffffffff/2)*sin(res)) );
//     //     res+=d;
//     //     if(i%10==0) fprintf(fd,"\n\t");
//     // }
//     // fprintf(fd,"\n};\n");
//     // fclose(fd);
//     // printf("%f\n",u_tg(45)/2147483647.0);
//     printf("%d\n",u_sqrt(3));
//     return 0;
// }

